<a href="https://colab.research.google.com/github/robsonbfreitas/TrabalhoFinal/blob/main/TrabalhoFinal.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [43]:
#Importando bibliotecas
import pandas as pd
from sklearn.linear_model import LinearRegression

In [44]:
df = pd.read_csv('features.csv')
#dftest = pd.read_csv('test.csv')
dftrain = pd.read_csv('train.csv')
df.head()

   Store        Date  Temperature  ...         CPI  Unemployment  IsHoliday
0      1  2010-02-05        42.31  ...  211.096358         8.106      False
1      1  2010-02-12        38.51  ...  211.242170         8.106       True
2      1  2010-02-19        39.93  ...  211.289143         8.106      False
3      1  2010-02-26        46.63  ...  211.319643         8.106      False
4      1  2010-03-05        46.50  ...  211.350143         8.106      False

[5 rows x 12 columns]

In [45]:
dftrain.head(30)

    Store  Dept        Date  Weekly_Sales  IsHoliday
0       1     1  2010-02-05      24924.50      False
1       1     1  2010-02-12      46039.49       True
2       1     1  2010-02-19      41595.55      False
3       1     1  2010-02-26      19403.54      False
4       1     1  2010-03-05      21827.90      False
5       1     1  2010-03-12      21043.39      False
6       1     1  2010-03-19      22136.64      False
7       1     1  2010-03-26      26229.21      False
8       1     1  2010-04-02      57258.43      False
9       1     1  2010-04-09      42960.91      False
10      1     1  2010-04-16      17596.96      False
11      1     1  2010-04-23      16145.35      False
12      1     1  2010-04-30      16555.11      False
13      1     1  2010-05-07      17413.94      False
14      1     1  2010-05-14      18926.74      False
15      1     1  2010-05-21      14773.04      False
16      1     1  2010-05-28      15580.43      False
17      1     1  2010-06-04      17558.09      False
18      1     1  2010-06-11      16637.62      False
19      1     1  2010-06-18      16216.27      False
20      1     1  2010-06-25      16328.72      False
21      1     1  2010-07-02      16333.14      False
22      1     1  2010-07-09      17688.76      False
23      1     1  2010-07-16      17150.84      False
24      1     1  2010-07-23      15360.45      False
25      1     1  2010-07-30      15381.82      False
26      1     1  2010-08-06      17508.41      False
27      1     1  2010-08-13      15536.40      False
28      1     1  2010-08-20      15740.13      False
29      1     1  2010-08-27      15793.87      False

In [66]:
frames = [df, dftrain]
df2 = pd.concat(frames)

In [67]:
df2.head(30)

    Store        Date  Temperature  ...  IsHoliday  Dept  Weekly_Sales
0       1  2010-02-05        42.31  ...      False   NaN           NaN
1       1  2010-02-12        38.51  ...       True   NaN           NaN
2       1  2010-02-19        39.93  ...      False   NaN           NaN
3       1  2010-02-26        46.63  ...      False   NaN           NaN
4       1  2010-03-05        46.50  ...      False   NaN           NaN
5       1  2010-03-12        57.79  ...      False   NaN           NaN
6       1  2010-03-19        54.58  ...      False   NaN           NaN
7       1  2010-03-26        51.45  ...      False   NaN           NaN
8       1  2010-04-02        62.27  ...      False   NaN           NaN
9       1  2010-04-09        65.86  ...      False   NaN           NaN
10      1  2010-04-16        66.32  ...      False   NaN           NaN
11      1  2010-04-23        64.84  ...      False   NaN           NaN
12      1  2010-04-30        67.41  ...      False   NaN           NaN
13      1  2010-05-07        72.55  ...      False   NaN           NaN
14      1  2010-05-14        74.78  ...      False   NaN           NaN
15      1  2010-05-21        76.44  ...      False   NaN           NaN
16      1  2010-05-28        80.44  ...      False   NaN           NaN
17      1  2010-06-04        80.69  ...      False   NaN           NaN
18      1  2010-06-11        80.43  ...      False   NaN           NaN
19      1  2010-06-18        84.11  ...      False   NaN           NaN
20      1  2010-06-25        84.34  ...      False   NaN           NaN
21      1  2010-07-02        80.91  ...      False   NaN           NaN
22      1  2010-07-09        80.48  ...      False   NaN           NaN
23      1  2010-07-16        83.15  ...      False   NaN           NaN
24      1  2010-07-23        83.36  ...      False   NaN           NaN
25      1  2010-07-30        81.84  ...      False   NaN           NaN
26      1  2010-08-06        87.16  ...      False   NaN           NaN
27      1  2010-08-13        87.00  ...      False   NaN           NaN
28      1  2010-08-20        86.65  ...      False   NaN           NaN
29      1  2010-08-27        85.22  ...      False   NaN           NaN

[30 rows x 14 columns]

In [68]:
df2.dtypes

Store             int64
Date             object
Temperature     float64
Fuel_Price      float64
MarkDown1       float64
MarkDown2       float64
MarkDown3       float64
MarkDown4       float64
MarkDown5       float64
CPI             float64
Unemployment    float64
IsHoliday          bool
Dept            float64
Weekly_Sales    float64
dtype: object

In [69]:
df2.head()

   Store        Date  Temperature  ...  IsHoliday  Dept  Weekly_Sales
0      1  2010-02-05        42.31  ...      False   NaN           NaN
1      1  2010-02-12        38.51  ...       True   NaN           NaN
2      1  2010-02-19        39.93  ...      False   NaN           NaN
3      1  2010-02-26        46.63  ...      False   NaN           NaN
4      1  2010-03-05        46.50  ...      False   NaN           NaN

[5 rows x 14 columns]

In [70]:
df3 = df2[['Store','Date','IsHoliday', 'Dept', 'Weekly_Sales']]
df3.head()

   Store        Date  IsHoliday  Dept  Weekly_Sales
0      1  2010-02-05      False   NaN           NaN
1      1  2010-02-12       True   NaN           NaN
2      1  2010-02-19      False   NaN           NaN
3      1  2010-02-26      False   NaN           NaN
4      1  2010-03-05      False   NaN           NaN

In [53]:
df3['Date'] = pd.to_datetime(df3['Date'])

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [71]:
df3.set_index(['Date'], inplace=True)

In [72]:
df3.head()

            Store  IsHoliday  Dept  Weekly_Sales
Date
2010-02-05      1      False   NaN           NaN
2010-02-12      1       True   NaN           NaN
2010-02-19      1      False   NaN           NaN
2010-02-26      1      False   NaN           NaN
2010-03-05      1      False   NaN           NaN

In [73]:
df3.fillna(0, inplace=True)

/usr/local/lib/python3.7/dist-packages/pandas/core/frame.py:4327: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  downcast=downcast,

In [92]:
df3.head(100)

            Store  IsHoliday  Dept  Weekly_Sales
Date
2010-02-05      1      False   0.0           0.0
2010-02-12      1       True   0.0           0.0
2010-02-19      1      False   0.0           0.0
2010-02-26      1      False   0.0           0.0
2010-03-05      1      False   0.0           0.0
...           ...        ...   ...           ...
2011-12-02      1      False   0.0           0.0
2011-12-09      1      False   0.0           0.0
2011-12-16      1      False   0.0           0.0
2011-12-23      1      False   0.0           0.0
2011-12-30      1       True   0.0           0.0

[100 rows x 4 columns]

In [78]:
y = df3[['Weekly_Sales']]
y

            Weekly_Sales
Date
2010-02-05          0.00
2010-02-12          0.00
2010-02-19          0.00
2010-02-26          0.00
2010-03-05          0.00
...                  ...
2012-09-28        508.37
2012-10-05        628.10
2012-10-12       1061.02
2012-10-19        760.01
2012-10-26       1076.80

[429760 rows x 1 columns]

In [79]:
y = y.iloc[1:]
y.head()

            Weekly_Sales
Date
2010-02-12           0.0
2010-02-19           0.0
2010-02-26           0.0
2010-03-05           0.0
2010-03-12           0.0

In [81]:
X = df3[['Store','Dept','IsHoliday','Weekly_Sales']].shift(1)
#X = df.shift(1)
X

            Store  Dept IsHoliday  Weekly_Sales
Date
2010-02-05    NaN   NaN       NaN           NaN
2010-02-12    1.0   0.0     False          0.00
2010-02-19    1.0   0.0      True          0.00
2010-02-26    1.0   0.0     False          0.00
2010-03-05    1.0   0.0     False          0.00
...           ...   ...       ...           ...
2012-09-28   45.0  98.0     False        467.30
2012-10-05   45.0  98.0     False        508.37
2012-10-12   45.0  98.0     False        628.10
2012-10-19   45.0  98.0     False       1061.02
2012-10-26   45.0  98.0     False        760.01

[429760 rows x 4 columns]

In [82]:
X = X.iloc[1:]
X.head()

            Store  Dept IsHoliday  Weekly_Sales
Date
2010-02-12    1.0   0.0     False           0.0
2010-02-19    1.0   0.0      True           0.0
2010-02-26    1.0   0.0     False           0.0
2010-03-05    1.0   0.0     False           0.0
2010-03-12    1.0   0.0     False           0.0

In [83]:
y.shape, X.shape

((429759, 1), (429759, 4))

In [84]:
X = pd.get_dummies(X)
X.head()

            Store  Dept  Weekly_Sales  IsHoliday_False  IsHoliday_True
Date
2010-02-12    1.0   0.0           0.0                1               0
2010-02-19    1.0   0.0           0.0                0               1
2010-02-26    1.0   0.0           0.0                1               0
2010-03-05    1.0   0.0           0.0                1               0
2010-03-12    1.0   0.0           0.0                1               0

In [85]:
X.isna().mean()

Store              0.0
Dept               0.0
Weekly_Sales       0.0
IsHoliday_False    0.0
IsHoliday_True     0.0
dtype: float64

In [86]:
reg = LinearRegression()
reg.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [87]:
X.shape

(429759, 5)

In [88]:
y.shape

(429759, 1)

In [90]:
result = reg.predict(X)

In [91]:
result

array([[ 862.66711111],
       [-488.44281696],
       [ 862.66711111],
       ...,
       [1742.52679382],
       [2151.1559217 ],
       [1867.03540571]])